[
  {
    "title": "Your Name",
    "synopsis": "Mitsuha Miyamizu is a high school girl living in the countryside town of Itomori. She yearns for a life in Tokyo as she is sick of living in the countryside. At the same time, Taki Tachibana, a high school student, lives in Tokyo and has a great interest in architecture, aiming to become an urban planner in the near future.",
    "duration": 107,
    "releaseDate": "2016-06-18",
    "coverUrl": "https://cdn.myanimelist.net/images/manga/1/182270.jpg",
    "rating": 8.39,
    "isNowShowing": false
  },
  {
    "title": "Weathering with You",
    "synopsis": "Tokyo is currently experiencing rain showers that seem to disrupt the usual pace of everyone living there to no end. Amidst this seemingly eternal downpour arrives the runaway high school student Hodaka Morishima, who struggles to financially support himself—ending up with a job at a small-time publisher. At the same time, the orphaned Hina Amano also strives to find work to sustain herself and her younger brother.",
    "duration": 112,
    "releaseDate": "2019-07-19",
    "coverUrl": "https://cdn.myanimelist.net/images/anime/1880/101146.jpg",
    "rating": 8.29,
    "isNowShowing": false
  },
  {
    "title": "Suzume no Tojimari",
    "synopsis": "On her way to school one day, Suzume Iwato stumbles upon Souta Munakata, a young man searching for abandoned areas. The high school girl directs Souta to a nearby ruin, but out of pure curiosity, she herself decides to head to the same destination.",
    "duration": 121,
    "releaseDate": "2022-11-11",
    "coverUrl": "https://cdn.myanimelist.net/images/anime/1598/128450.jpg",
    "rating": 8.39,
    "isNowShowing": true
  },
  {
    "title": "Dragon Ball Super: Broly",
    "synopsis": "Forty-one years ago on Planet Vegeta, home of the infamous Saiyan warrior race, King Vegeta noticed a baby named Broly whose latent power exceeded that of his own son. Believing that Broly's power would one day surpass that of his child, Vegeta, the king sends Broly to the desolate planet Vampa. Broly's father Paragus follows after him, intent on rescuing his son. However, his ship gets damaged, causing the two to spend years trapped on the barren world, unaware of the salvation that would one day come from an unlikely ally.",
    "duration": 100,
    "releaseDate": "2018-12-14",
    "coverUrl": "https://cdn.myanimelist.net/images/anime/1575/93498.jpg",
    "rating": 8.16,
    "isNowShowing": true
  },
  {
    "title": "The Last: Naruto the Movie",
    "synopsis": "Two years have passed since the end of the Fourth Great Ninja War. Konohagakure has remained in a state of peace and harmony—until Sixth Hokage Kakashi Hatake notices the moon is dangerously approaching the Earth, posing the threat of planetary ruin.",
    "duration": 112,
    "releaseDate": "2014-12-06",
    "coverUrl": "https://cdn.myanimelist.net/images/anime/1491/134498.jpg",
    "rating": 7.79,
    "isNowShowing": false
  },
  {
    "title": "Kimetsu no Yaiba Movie: Mugen Ressha-hen",
    "synopsis": "After a string of mysterious disappearances begin to plague a train, the Demon Slayer Corps' multiple attempts to remedy the problem prove fruitless. To prevent further casualties, the Flame Pillar, Kyoujurou Rengoku, takes it upon himself to eliminate the threat. Accompanying him are some of the Corps' most promising new blood: Tanjirou Kamado, Zenitsu Agatsuma, and Inosuke Hashibira, who all hope to witness the fiery feats of this model demon slayer firsthand.",
    "duration": 115,
    "releaseDate": "2020-10-16",
    "coverUrl": "https://cdn.myanimelist.net/images/anime/1704/106947.jpg",
    "rating": 8.61,
    "isNowShowing": false
  },
  {
    "title": "Black Clover: Sword of the Wizard King",
    "synopsis": "As a lionhearted boy who can’t wield magic strives for the title of Wizard King, four banished Wizard Kings of yore return to crush the Clover Kingdom.",
    "duration": 113,
    "releaseDate": "2023-06-16",
    "coverUrl": "https://cdn.myanimelist.net/images/anime/1337/136363.jpg",
    "rating": 8.1,
    "isNowShowing": true
  }
]
